ДО_для_разработки/src/InformationRegisters/ТекущиеСостоянияДокументов/ТекущиеСостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеСостоянияДокументов</name>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>BusinessProcessRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДО_для_разработки/src/Enums/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументов</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
  <enumValues>
    <name>НаРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>НеЗарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

ДО_для_разработки/src/InformationRegisters/ТекущиеСостоянияДокументов/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") Тогда
		ЗарегистрироватьСогласуемыеДокументы("ОбменБухгалтерияПредприятияДокументооборот20");
		ЗарегистрироватьСогласуемыеДокументы("ОбменУправлениеХолдингомДокументооборот20");
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует документы при изменении состояния согласования
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для узлов которого следует выполнить регистрацию
//
Процедура ЗарегистрироватьСогласуемыеДокументы(ИмяПланаОбмена)
	
	УзлыПланаОбмена = ОбменДаннымиПовтИсп.УзлыПланаОбмена(ИмяПланаОбмена);
	Если УзлыПланаОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоставПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если (Запись.Состояние = Перечисления.СостоянияДокументов.НаСогласовании
			или Запись.Состояние = Перечисления.СостоянияДокументов.Согласован
			или Запись.Состояние = Перечисления.СостоянияДокументов.НеСогласован) 
			и СоставПланаОбмена.Содержит(Запись.Документ.Метаданные()) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыПланаОбмена, Запись.Документ);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли
